---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.LockedDeleted
source: html/1bc5cf0f-a4c5-eda3-6ed9-8fdd2fe6b107.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.LockedDeleted Property

Pinned objects deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId LockedDeleted { get; }
```